#include"includes.h"
/*
----------------------------------------------------------------------
*  函数名称：void Application(void)
*  函数功能：K1按下LED1、LED2亮起，K2按下LED1、LED2熄灭
*  输入形参：无  	
*  返回值：无	
*
----------------------------------------------------------------------
*/
void Application(void)
{

	while(1)
	{
		if(READ_KEY_1==0) //如果按键1按下
		{
			delay_ms(50);//削抖
			if(READ_KEY_1==0)
			{
				while(READ_KEY_1==0);//等待按键松开
				LED_1(ON);
				LED_2(ON);	
			}
		}
		if(READ_KEY_2==0) //如果按键2按下
		{
			delay_ms(50);//削抖
			if(READ_KEY_2==0)
			{			
				while(READ_KEY_2==0);//等待按键松开
				LED_1(OFF);
				LED_2(OFF);
			}
		}
	}
}

 /*
************************************************************************
*  函数名称：
*  函数功能：
*  输入形参：  	
*  返回值：	
*
************************************************************************
*/
void Board_Init(void)
{
	//调整时钟频率到72M
	SystemInit();
	//延时初始化
	delay_init(72); 
   	//LED初始化
	LED_Init();
	//按键初始化	
	KEY_Init();
}
