#include"includes.h"
/*
---------------------------------------------------------------------------
*  函数名称：void Application(void)
*  函数功能：如果有图像数据准备读的话，读取数据并处理
*  输入形参：  无	
*  返回值：		无		

		
---------------------------------------------------------------------------
*/
void Application(void)
{  
	
	while(1)
	{ 	
		Change_Speed(540);
		delay_ms(1000);
		delay_ms(1000);
		Change_Speed(580);
		delay_ms(1000);
		delay_ms(1000);
	}	
}

/*
-------------------------------------------------------------------------
*  函数名称：
*  函数功能：
*  输入形参：  	
*  返回值：		 	
---------------------------------------------------------------------------
*/
void Board_Init(void)
{	
	u8 i;	
	//系统时钟配置 									   
	SystemInit();
	//延时函数初始化		   	
	delay_init(72);
	//定时器1初始化		 
	TIM1_config();
  	//舵机初始化
	Motor_Init(); 	
	Servo_Init();
	//串口配置
	USART_Config();	
	//串口中断配置   	
	NVIC_Config();
	//LED初始化		
	LED_Init();
	//按键初始化				
	KEY_Init();	 
	//等待电调中间值确定	
	for(i=0;i<3;i++)	
	{
		delay_ms(1000);
	}   	
}
