#include"includes.h"
/*
------------------------------------------------------------------------
*  函数名称：Application(void)
*  函数功能：LED1和LED2每隔一段时间亮灭一次
*  输入形参：无  	
*  返回值：无											
------------------------------------------------------------------------
*/	 
void Application(void)
{
	while(1)
	{		  
		LED_1(ON);
		LED_2(ON);
		delay_ms(1000);
		LED_1(OFF);
		LED_2(OFF);
		delay_ms(1000);
	}
}

/*
------------------------------------------------------------------------
*  函数名称：void Board_Init(void)
*  函数功能：初始化开发板硬件
*  输入形参：无  	
*  返回值：											
------------------------------------------------------------------------
*/
void Board_Init(void)
{
	//将外部8M晶振作为时钟源并将频率调整到72MHZ
	//3.5版本的库不需要这一步，因为在启动文件中已经做好了
	SystemInit();
	//调用延时初始化函数，利用SYSTICK定时器做精确定时
	delay_init(72);
	//调用LED初始化函数
	LED_Init();
}
