#include"includes.h"
/*
************************************************************************
*  函数名称：void Application(void)
*  函数功能：应用层函数
*  输入形参：无  	
*  返回值：无	
*
************************************************************************
*/
void Application(void)
{

	LED_1(ON);
	LED_2(ON);
	while(1)
	{
		
	}
}
 /*
************************************************************************
*  函数名称：void Board_Init(void)
*  函数功能：调初始化函数用底层
*  输入形参：无  	
*  返回值：无	
*
************************************************************************
*/
void Board_Init(void)
{
	//系统时钟初始化
	SystemInit();
	//LED接口初始化
	LED_Init();
	//串口配置
	USART_Config();
	//按键外部中断 配置
	EXTI_Config();
	//串口中断配置
	NVIC_Config();
}
