#include"includes.h"
/*
------------------------------------------------------------------------
  函数名称：void Application(void)
  函数功能：应用函数入口
  输入形参：无  	
  返回值：无	
------------------------------------------------------------------------
*/
void Application(void)
{
	//死循环 ，在这里添加功能模块
	while(1)
	{

	}

}
/*
------------------------------------------------------------------------
  函数名称：void Board_Init(void)
  函数功能：硬件初始化函数，初始化各个硬件模块
  输入形参：无  	
  返回值：无	
------------------------------------------------------------------------
*/
void Board_Init(void)
{


}
