#include"includes.h"
/*
---------------------------------------------------------------------------
*  函数名称：void Application(void)
*  函数功能：读取图像数据，进行图像处理根据处理结果控制舵机方向与车速
*  输入形参：无	
*  返回值：无	
---------------------------------------------------------------------------
*/
void Application(void)
{  
	Change_Speed(540);
	while(1)
	{ 	
		encoder_num=TIM_GetCounter(TIM4);
		printf("%d    \n",encoder_num); 			
	}	
}

/*
-------------------------------------------------------------------------
*  函数名称：void Board_Init(void)
*  函数功能：调用底层硬件初始化函数，供main()函数调用
*  输入形参：无  	
*  返回值：无		 	
---------------------------------------------------------------------------
*/
void Board_Init(void)
{	
	u8 i;
	/*时钟系统配置*/
	SystemInit();
	/*延时函数初始化*/			
	delay_init(72);	
	/*编码器初始化*/
	Encoder_Init();
	/*定时器1初始化*/
	TIM1_config();
	/*电调初始化*/
	Motor_Init();
   	/*串口初始化*/
	USART_Config();	
	/*等待电调确定中值*/  
	for(i=0;i<4;i++)
	{
		delay_ms(1000);
	}
}

